УТ_для_edt/src/Documents/смартУстановкаУсловийДополнительнойГарантии/смартУстановкаУсловийДополнительнойГарантии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартУстановкаУсловийДополнительнойГарантии</name>
  <comment>//++ #1944 смарт: Мосолов 26.07.2024 // Реализовать механизм предложения доп гарантии при покупке оборудования.</comment>
  <registerRecords>InformationRegister.смартУсловияДополнительнойГарантии</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокОборудования</name>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.смартОборудованиеКлиентов</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокГарантииНаОборудование</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокГарантииНаГоловку</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДопГарантииНаПервомЭтапе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДопГарантииНаВторомЭтапе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаДействияУсловий</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияДействияУсловий</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Недействителен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/Documents/смартУстановкаУсловийДополнительнойГарантии/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	// Создадим запрос инициализации движений
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	// Сформируем текст запроса
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапросаТаблицаУсловияДополнительнойГарантии(Запрос, ТекстыЗапроса, Регистры);
	
	ПроведениеСерверУТ.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
	
КонецПроцедуры 

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Дата 						КАК Период
	|ИЗ
	|	Документ.смартУстановкаУсловийДополнительнойГарантии КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|";	
	Реквизиты = Запрос.Выполнить().Выгрузить();
		
	Для Каждого Колонка Из Реквизиты.Колонки Цикл
		Запрос.УстановитьПараметр(Колонка.Имя, Реквизиты[0][Колонка.Имя]);
	КонецЦикла;
	
КонецПроцедуры 

Функция ТекстЗапросаТаблицаУсловияДополнительнойГарантии(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "смартУсловияДополнительнойГарантии";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Ссылка КАК Регистратор,
	|	Таблица.Оборудование КАК Оборудование,
	|	Таблица.СрокГарантииНаОборудование КАК СрокГарантииНаОборудование,
	|	Таблица.СрокГарантииНаГоловку КАК СрокГарантииНаГоловку,
	|	Таблица.СтоимостьДопГарантииНаПервомЭтапе КАК СтоимостьДопГарантииНаПервомЭтапе,
	|	Таблица.СтоимостьДопГарантииНаВторомЭтапе КАК СтоимостьДопГарантииНаВторомЭтапе,
	|	Таблица.ДатаНачалаДействияУсловий КАК ДатаНачалаДействияУсловий,
	|	Таблица.ДатаОкончанияДействияУсловий КАК ДатаОкончанияДействияУсловий
	|ИЗ
	|	Документ.смартУстановкаУсловийДополнительнойГарантии.СписокОборудования КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка
	|	И НЕ Таблица.Недействителен";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции 

#КонецОбласти 

#КонецОбласти

#КонецЕсли
